# <span style= 'color:darkblue'> Investigating a pizza business </span>

## <span style='color:blue'>1. Data wrangling

In [1]:
%load_ext sql
%sql mysql://root:Elprofesor009!@localhost/pizzahut
import pandas as pd
import numpy as np

In [2]:
# let's check the data types of each columns over the 4 tables

%sql DESCRIBE order_details

 * mysql://root:***@localhost/pizzahut
4 rows affected.

[('order_details_id', 'int', 'YES', '', None, ''),
 ('order_id', 'int', 'YES', '', None, ''),
 ('pizza_id', 'text', 'YES', '', None, ''),
 ('quantity', 'int', 'YES', '', None, '')]

In [3]:
%sql DESCRIBE orders

 * mysql://root:***@localhost/pizzahut
3 rows affected.

[('order_id', 'int', 'YES', '', None, ''),
 ('date', 'date', 'YES', '', None, ''),
 ('time', 'text', 'YES', '', None, '')]

In [4]:
# the date column is not in the right data type!

%sql UPDATE orders SET date = STR_TO_DATE(date, '%m/%d/%Y') WHERE date NOT LIKE '%-%-%';

 * mysql://root:***@localhost/pizzahut
0 rows affected.

[]

In [5]:
%sql ALTER TABLE orders MODIFY COLUMN date DATE

 * mysql://root:***@localhost/pizzahut
0 rows affected.

[]

In [23]:
# change the time column into time data type

%sql UPDATE orders SET time = STR_TO_DATE(time, '%r') WHERE time LIKE '%AM%' OR time LIKE '%PM%';

 * mysql://root:***@localhost/pizzahut
0 rows affected.

[]

In [24]:
%sql ALTER TABLE orders MODIFY COLUMN time TIME;

 * mysql://root:***@localhost/pizzahut
21350 rows affected.

[]

In [25]:
# let's check the orders table again
%sql DESCRIBE orders

 * mysql://root:***@localhost/pizzahut
3 rows affected.

[('order_id', 'int', 'YES', '', None, ''),
 ('date', 'date', 'YES', '', None, ''),
 ('time', 'time', 'YES', '', None, '')]

In [7]:
%sql DESCRIBE pizza_types

 * mysql://root:***@localhost/pizzahut
4 rows affected.

[('pizza_type_id', 'text', 'YES', '', None, ''),
 ('name', 'text', 'YES', '', None, ''),
 ('category', 'text', 'YES', '', None, ''),
 ('ingredients', 'text', 'YES', '', None, '')]

In [8]:
%sql DESCRIBE pizzas

 * mysql://root:***@localhost/pizzahut
4 rows affected.

[('pizza_id', 'text', 'YES', '', None, ''),
 ('pizza_type_id', 'text', 'YES', '', None, ''),
 ('size', 'text', 'YES', '', None, ''),
 ('price', 'double', 'YES', '', None, '')]

#### All the columns of the four tables are in the correct data types

## <span style='color:blue'>2. Business Questions

### 3.1 What is the total number of orders placed?

In [9]:
%sql SELECT COUNT(order_id) AS order_count FROM orders

 * mysql://root:***@localhost/pizzahut
1 rows affected.

[(21350,)]

### 3.2 What are the total sales revenue generated?

In [10]:
%%sql
SELECT round(SUM(quantity * price),0) AS Total_sales_Rev
FROM order_details O LEFT OUTER JOIN pizzas P
ON O.pizza_id = P.pizza_id

 * mysql://root:***@localhost/pizzahut
1 rows affected.

[(817860.0,)]

### 3.3 How do the total number of orders change over time?

In [19]:
%%sql
SELECT MONTH (date) AS order_month, COUNT(order_id) AS order_count 
FROM orders
GROUP BY order_month
ORDER BY order_month

 * mysql://root:***@localhost/pizzahut
12 rows affected.

[(1, 1845),
 (2, 1685),
 (3, 1840),
 (4, 1799),
 (5, 1853),
 (6, 1773),
 (7, 1935),
 (8, 1841),
 (9, 1661),
 (10, 1646),
 (11, 1792),
 (12, 1680)]

### 3.4 What is the average value of each order?

In [12]:
%%sql
SELECT round(817860.0/21350,0) AS avg_order_value

 * mysql://root:***@localhost/pizzahut
1 rows affected.

[(Decimal('38'),)]

### 3.5 Which pizza type is the top-selling item?

In [13]:
%%sql
SELECT t.name, ROUND(SUM(o.quantity * p.price), 0) AS Sales_Rev
FROM order_details o
LEFT OUTER JOIN pizzas p ON o.pizza_id = p.pizza_id
LEFT OUTER JOIN pizza_types t ON p.pizza_type_id = t.pizza_type_id
GROUP BY t.name
ORDER BY Sales_Rev DESC
LIMIT 5;

 * mysql://root:***@localhost/pizzahut
5 rows affected.

[('The Thai Chicken Pizza', 43434.0),
 ('The Barbecue Chicken Pizza', 42768.0),
 ('The California Chicken Pizza', 41410.0),
 ('The Classic Deluxe Pizza', 38180.0),
 ('The Spicy Italian Pizza', 34831.0)]

### 3.6 How are sales distributed across different pizza categories?

In [14]:
%%sql
SELECT t.category, ROUND(SUM(o.quantity * p.price), 0) AS Sales_Rev
FROM order_details o
LEFT OUTER JOIN pizzas p ON o.pizza_id = p.pizza_id
LEFT OUTER JOIN pizza_types t ON p.pizza_type_id = t.pizza_type_id
GROUP BY t.category
ORDER BY Sales_Rev DESC
LIMIT 5;

 * mysql://root:***@localhost/pizzahut
4 rows affected.

[('Classic', 220053.0),
 ('Supreme', 208197.0),
 ('Chicken', 195920.0),
 ('Veggie', 193690.0)]

### 3.7 How do order volumes vary by day of the week?

In [15]:
%%sql
SELECT DAY (date) AS order_day, COUNT(order_id) AS order_count 
FROM orders
GROUP BY order_day
ORDER BY order_day

 * mysql://root:***@localhost/pizzahut
31 rows affected.

[(1, 820),
 (2, 712),
 (3, 721),
 (4, 747),
 (5, 625),
 (6, 727),
 (7, 710),
 (8, 719),
 (9, 703),
 (10, 728),
 (11, 731),
 (12, 634),
 (13, 718),
 (14, 715),
 (15, 809),
 (16, 713),
 (17, 717),
 (18, 699),
 (19, 634),
 (20, 728),
 (21, 687),
 (22, 664),
 (23, 716),
 (24, 669),
 (25, 557),
 (26, 666),
 (27, 786),
 (28, 648),
 (29, 587),
 (30, 627),
 (31, 433)]

### 3.8 What is the distribution of orders by hour of the day?

In [26]:
%%sql
SELECT HOUR (time) AS order_hour, COUNT(order_id) AS order_count 
FROM orders
GROUP BY order_hour
ORDER BY order_hour

 * mysql://root:***@localhost/pizzahut
15 rows affected.

[(9, 1),
 (10, 8),
 (11, 1231),
 (12, 2520),
 (13, 2455),
 (14, 1472),
 (15, 1468),
 (16, 1920),
 (17, 2336),
 (18, 2399),
 (19, 2009),
 (20, 1642),
 (21, 1198),
 (22, 663),
 (23, 28)]